crowdfund/app/controllers/projects_controller.rb

	def index
		@projects = Project.all
---
SELECT "projects".* FROM "projects"  WHERE (pledging_ends_on >= '2015-07-10 01:28:38.808806')  ORDER BY pledging_ends_on asc

	def update
		@project = Project.find(params[:id])
		@project.update(project_params)
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = 2  [["description", "A description of a community project!"], ["updated_at", "2015-07-11 17:51:31.369019"]]