crowdfund/app/views/projects/index.html.erb

SELECT "projects".* FROM "projects"  WHERE (pledging_ends_on >= '2015-07-10 01:28:38.808806')  ORDER BY pledging_ends_on asc
---
<h1><%= pluralize(@projects.size, "Project") %></h1>