events/app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "events" SET "capacity" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["capacity", 3], ["starts_at", "2015-10-18 01:25:00.000000"], ["updated_at", "2015-07-14 01:55:51.414858"]]
---
	def update
		@event = Event.find(params[:id])
		@event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@event = Event.new(event_params)
		@event.save