events/app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "email", "event_id", "how_heard", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@registration = @event.registrations.new(registration_params)
		if @registration.save