flix/app/controllers/movies_controller.rb

	def index
		@movies = Movie.all
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-07-10 01:27:12.334979')  ORDER BY released_on desc