flix/app/controllers/reviews_controller.rb

	def create
		@review = @movie.reviews.new(reviews_params)
		if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Such an awesome movie!"], ["created_at", "2015-07-14 01:00:36.098554"], ["movie_id", 1], ["name", "Brandon Braun"], ["stars", 5], ["updated_at", "2015-07-14 01:00:36.098554"]]