flix/app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, "Movie") %></h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-07-10 01:27:12.334979')  ORDER BY released_on desc